# quizy_data.py

quiz_questions_classes = [
    {
        "question": "Какое животное больше всего вам нравится?",
        "options": ["Млекопитающие", "Птицы", "Рептилии"],
        "points": {"Млекопитающие": 1, "Птицы": 0, "Рептилии": 0}
    },
    {
        "question": "Какое животное вы бы хотели увидеть в дикой природе?",
        "options": ["Млекопитающие", "Птицы", "Рептилии"],
        "points": {"Млекопитающие": 1, "Птицы": 0, "Рептилии": 0}
    },
    {
        "question": "Какое животное вам кажется самым умным?",
        "options": ["Млекопитающие", "Птицы", "Рептилии"],
        "points": {"Млекопитающие": 1, "Птицы": 0, "Рептилии": 0}
    },
    {
        "question": "Какое животное вам кажется самым красивым?",
        "options": ["Млекопитающие", "Птицы", "Рептилии"],
        "points": {"Млекопитающие": 1, "Птицы": 0, "Рептилии": 0}
    },
    {
        "question": "Какое животное вы бы выбрали в качестве домашнего питомца?",
        "options": ["Млекопитающие", "Птицы", "Рептилии"],
        "points": {"Млекопитающие": 1, "Птицы": 0, "Рептилии": 0}
    },
    {
        "question": "Какое животное вам кажется самым опасным?",
        "options": ["Млекопитающие", "Птицы", "Рептилии"],
        "points": {"Млекопитающие": 0, "Птицы": 0, "Рептилии": 1}
    }
]

quiz_questions_animals = [
    {
        "question": "Какое из этих животных вам больше нравится?",
        "options": ["Китайский лев", "Амурский тигр", "Африканский слон", "Малая панда"],
        "points": {"Китайский лев": 1, "Амурский тигр": 0, "Африканский слон": 0, "Малая панда": 0}
    },
    {
        "question": "Какое животное вам кажется самым дружелюбным?",
        "options": ["Капибара", "Европейский волк", "Рысь", "Лиса"],
        "points": {"Капибара": 1, "Европейский волк": 0, "Рысь": 0, "Лиса": 0}
    },
    # Добавьте еще вопросы для животных
]

# Специальные вопросы для каждого класса
special_questions = {
    "Млекопитающие": {
        "question": "Какое из этих качеств вам ближе?",
        "options": ["Сила", "Ум", "Доброта", "Лояльность"],
        "points": {
            "Сила": ["Китайский лев", "Амурский тигр"],
            "Ум": ["Капибара", "Дельфин"],
            "Доброта": ["Малая панда", "Слон"],
            "Лояльность": ["Собака", "Волк"]
        }
    },
    "Птицы": {
        "question": "Какое из этих качеств вам ближе?",
        "options": ["Свобода", "Красота", "Ум", "Скорость"],
        "points": {
            "Свобода": ["Орлан", "Сапсан"],
            "Красота": ["Попугай", "Фламинго"],
            "Ум": ["Воробей", "Голубь"],
            "Скорость": ["Стриж", "Сокол"]
        }
    },
    "Рептилии": {
        "question": "Какое из этих качеств вам ближе?",
        "options": ["Холоднокровие", "Скрытность", "Сила", "Ум"],
        "points": {
            "Холоднокровие": ["Крокодил", "Ящерица"],
            "Скрытность": ["Гадюка", "Медянка"],
            "Сила": ["Анаконда", "Игуана"],
            "Ум": ["Черепаха", "Ящерица"]
        }
    }
}
